In [2]:
import pandas as pd

df= pd.DataFrame({
    'city': ['delhi', 'nashik', 'pune', 'mumbai', 'delhi', 'pune'],
    'price': [200,150,300,250,180,320]
})

In [3]:
df

     city  price
0   delhi    200
1  nashik    150
2    pune    300
3  mumbai    250
4   delhi    180
5    pune    320

In [5]:
mean_price= df.groupby('city')['price'].mean().to_dict()

In [6]:
df['city_encoded']= df['city'].map(mean_price)

In [9]:
df[['price', 'city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0